Revit 2027 API
Curve.ComputeNormalizedParameter Method
Computes the normalized curve parameter from the raw parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ComputeNormalizedParameter(
	double rawParameter
)
Public Function ComputeNormalizedParameter (
	rawParameter As Double
) As Double
public:
double ComputeNormalizedParameter(
	double rawParameter
)
member ComputeNormalizedParameter :
        rawParameter : float -> float
Parameters
rawParameter Double
The raw parameter.
Return Value
Double
The real number equal to the normalized curve parameter.
Exceptions
Exception | Condition
ArgumentException |  Thrown when rawParameter is infinite.
InvalidOperationException |  Thrown when the curve is unbound.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace